# Pandas

In [2]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\masum\.conda\envs\course_env\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\masum\.conda\envs\course_env\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\masum\.conda\envs\course_env\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\masum\.conda\envs\course_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\masum\.conda\envs\course_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\masum\.conda\envs\course_env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
# import pandas
import pandas as pd

In [4]:
pd.__version__

'2.3.3'

Series: A one-dimensional labeled array capable of holding any data type, similar to a single column in a spreadsheet.

In [ ]:
# series from list
data=[1,2,3,4,5]
srs=pd.Series(data)
print(srs)
print(type(srs))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
# Create a series from dictionaries
data={
    'a':1,
    'b':2,
    'c':3
}
d_srs=pd.Series(data)
d_srs

a    1
b    2
c    3
dtype: int64

In [ ]:
data=[1,2,3,4,5]
ind=['a','b','c','d','e']
i_srs=pd.Series(data,index=ind)
i_srs

a    1
b    2
c    3
d    4
e    5
dtype: int64

csv means comma separated values

xls means excel file

DataFrame: A two-dimensional, size-mutable, tabular data structure with labeled axes (rows and columns), resembling a spreadsheet or SQL table. The DataFrame is the most commonly used pandas object.

In [10]:
# create a datafram from dictionary of lists
data={
    'name':['masum','sabrina','puja','oishe'],
    'age':[23,24,26,30],
    'city':['dhaka','khulna','faridpur','natore']
}

dframe=pd.DataFrame(data)
print(dframe)
print(type(dframe))

      name  age      city
0    masum   23     dhaka
1  sabrina   24    khulna
2     puja   26  faridpur
3    oishe   30    natore
<class 'pandas.core.frame.DataFrame'>

In [11]:
# create a datafram from list of dictionary 
data=[
    {'name':'Masum','age':23,'city':'dhaka'},
    {'name':'Sabrina','age':23,'city':'dhaka'},
    {'name':'puja','age':23,'city':'dhaka'},
    {'name':'oishe','age':23,'city':'dhaka'}
]
ldframe=pd.DataFrame(data)
ldframe

      name  age   city
0    Masum   23  dhaka
1  Sabrina   23  dhaka
2     puja   23  dhaka
3    oishe   23  dhaka

In [14]:
df=pd.read_csv('sales_data.csv')

In [15]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df.head(6)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card

In [22]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [23]:
data={
    'name':['masum','sabrina','puja','oishe'],
    'age':[23,24,26,30],
    'city':['dhaka','khulna','faridpur','natore']
}

dframe=pd.DataFrame(data)

In [24]:
dframe

      name  age      city
0    masum   23     dhaka
1  sabrina   24    khulna
2     puja   26  faridpur
3    oishe   30    natore

In [27]:
# access values by column name
dframe['name']

0      masum
1    sabrina
2       puja
3      oishe
Name: name, dtype: object

In [28]:
# accesss values by row index
dframe.loc[2]

name        puja
age           26
city    faridpur
Name: 2, dtype: object

In [29]:
dframe.iloc[2]

name        puja
age           26
city    faridpur
Name: 2, dtype: object

In [30]:
dframe

      name  age      city
0    masum   23     dhaka
1  sabrina   24    khulna
2     puja   26  faridpur
3    oishe   30    natore

In [ ]:
dframe.iat[1,2] # row column

'khulna'

In [34]:
dframe.at[3,'city']

'natore'

In [35]:
dframe.at[2,'age']

np.int64(26)

In [36]:
dframe

      name  age      city
0    masum   23     dhaka
1  sabrina   24    khulna
2     puja   26  faridpur
3    oishe   30    natore

In [37]:
# Adding a new column
dframe['Salary']=[10000,20000,23000,5000]
dframe

      name  age      city  Salary
0    masum   23     dhaka   10000
1  sabrina   24    khulna   20000
2     puja   26  faridpur   23000
3    oishe   30    natore    5000

In [ ]:
# remove  a column
dframe.drop('city',axis=1,inplace=True)  # axis for row is 0 and column 1

In [43]:
dframe

      name  age  Salary
0    masum   23   10000
1  sabrina   24   20000
2     puja   26   23000
3    oishe   30    5000

In [ ]:
# drop based on row
dframe.drop(1,axis=0,inplace=True) # here 1 is the row index

In [45]:
dframe

    name  age  Salary
0  masum   23   10000
2   puja   26   23000
3  oishe   30    5000

In [51]:
# increase age after 5 year
dframe['age']=dframe['age']+5
dframe

    name  age  Salary
0  masum   28   10000
2   puja   31   23000
3  oishe   35    5000

In [52]:
dframe.describe()

             age        Salary
count   3.000000      3.000000
mean   31.333333  12666.666667
std     3.511885   9291.573243
min    28.000000   5000.000000
25%    29.500000   7500.000000
50%    31.000000  10000.000000
75%    33.000000  16500.000000
max    35.000000  23000.000000

In [53]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    240 non-null    int64
 1   Date              240 non-null    object
 2   Product Category  240 non-null    object
 3   Product Name      240 non-null    object
 4   Units Sold        240 non-null    int64
 5   Unit Price        240 non-null    float64
 6   Total Revenue     240 non-null    float64
 7   Region            240 non-null    object
 8   Payment Method    240 non-null    object
dtypes: float64(2), int64(2), object(5)
memory usage: 17.0+ KB